#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.db_password: Refreshing state... [id=none]
data.aws_security_group.web: Reading...
data.aws_subnet.b: Reading...
aws_iam_role.redis_container_role[0]: Refreshing state... [id=redis-container-role]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
data.aws_subnet.a: Reading...
aws_dynamodb_table.state_locking: Refreshing state... [id=xgr00q-test-state-locking]
aws_iam_role.api_gateway_s3_role: Refreshing state... [id=ApiGatewayAmazonS3AccessRole]
aws_cloudwatch_event_rule.request_monitor: Refreshing state... [id=request-monitor-scheduler]
module.s3_keycloak_v2.aws_s3_bucket.this: Refreshing state... [id=xgr00q-test-keycloak]
aws_acm_certificate.status: Refreshing state... [id=arn:aws:acm:ca-central-1:882670198625:certificate/bb67118a-d5fb-4bb0-8c58-424b1d6333cf]
data.aws_security_group.app: Reading...
data.aws_subnet.a: Read complete after 0s [id=subnet-0bc624d1ab6e8e88f]
data.aws_vpc.selected: Reading...
data.aws_iam_policy_document.ecs_task_execution_role: Reading...
data.aws_iam_policy_document.ecs_task_execution_role: Read complete after 0s [id=1077804475]
data.aws_subnet.b: Read complete after 0s [id=subnet-080f02b63c4516aac]
module.db.data.aws_partition.current: Reading...
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=kcbkts0s8a]
module.db.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy.permissions_boundary_policy: Reading...
data.aws_subnet.a_data: Reading...
data.aws_security_group.web: Read complete after 0s [id=sg-0abd4080abadbeb0d]
module.s3_sso_api_swagger.aws_s3_bucket.this: Refreshing state... [id=xgr00q-test-api-swagger]
data.aws_subnet.b_data: Reading...
aws_cloudwatch_event_rule.request_queue: Refreshing state... [id=request-queue-scheduler]
data.aws_security_group.app: Read complete after 0s [id=sg-0d4f0195cfa9c08ac]
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ca-central-1:882670198625:certificate/362f2f66-1423-4c5f-a0f5-d79c71d21f78]
aws_ecs_cluster.sso_ecs_cluster: Refreshing state... [id=arn:aws:ecs:ca-central-1:882670198625:cluster/sso-ecs-cluster]
data.aws_subnet.a_data: Read complete after 0s [id=subnet-0f1500aaed6236692]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20240523164749443800000004]
data.aws_subnet.b_data: Read complete after 1s [id=subnet-01090b42f500c6447]
aws_iam_role_policy.redis_cwlogs[0]: Refreshing state... [id=redis-container-role:redis-cw-logs]
aws_alb.sso_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:882670198625:loadbalancer/app/sso-alb/2513e229b7f3f9f4]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_apigatewayv2_domain_name.this: Refreshing state... [id=api-test.loginproxy.gov.bc.ca]
aws_api_gateway_resource.openapi_swagger: Refreshing state... [id=23yvm4]
aws_api_gateway_resource.app: Refreshing state... [id=c216sf]
aws_api_gateway_resource.api: Refreshing state... [id=xyqr7p]
aws_ecs_cluster_capacity_providers.sso_ecs_cluster_capacity_providers: Refreshing state... [id=sso-ecs-cluster]
aws_api_gateway_resource.swagger_assets_proxy: Refreshing state... [id=d3qwx0]
data.aws_vpc.selected: Read complete after 1s [id=vpc-0da3b0e781594bff3]
aws_api_gateway_resource.openapi_swagger_proxy: Refreshing state... [id=c4u2t7]
aws_api_gateway_resource.app_proxy: Refreshing state... [id=durnz2]
aws_security_group.rds_sg: Refreshing state... [id=sg-078ec4a8ff14313df]
aws_lb_target_group.redis[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:882670198625:targetgroup/redis/a5fa6407bea376ce]
aws_api_gateway_resource.api_proxy: Refreshing state... [id=qtwbra]
aws_apigatewayv2_api_mapping.this: Refreshing state... [id=6rcvcr]
aws_api_gateway_method.swagger_assets_proxy: Refreshing state... [id=agm-kcbkts0s8a-d3qwx0-GET]
aws_api_gateway_method.openapi_swagger_proxy: Refreshing state... [id=agm-kcbkts0s8a-c4u2t7-GET]
aws_api_gateway_method.app_proxy: Refreshing state... [id=agm-kcbkts0s8a-durnz2-ANY]
aws_api_gateway_method.api_proxy: Refreshing state... [id=agm-kcbkts0s8a-qtwbra-ANY]
aws_lb.redis_nlb[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:882670198625:loadbalancer/net/redis-nlb/97b762812053af45]
module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-test-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_versioning.this: Refreshing state... [id=xgr00q-test-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-test-keycloak]
module.s3_keycloak_v2.data.aws_iam_policy_document.deny_non_secure_access_doc: Reading...
module.s3_keycloak_v2.data.aws_iam_policy_document.deny_non_secure_access_doc: Read complete after 0s [id=2169713932]
module.s3_keycloak_v2.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-test-keycloak,private]
module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-test-keycloak]
aws_api_gateway_method_response.swagger_assets_proxy: Refreshing state... [id=agmr-kcbkts0s8a-d3qwx0-GET-200]
aws_api_gateway_method_response.openapi_swagger_proxy: Refreshing state... [id=agmr-kcbkts0s8a-c4u2t7-GET-200]
module.s3_keycloak_v2.aws_s3_bucket_policy.deny_non_secure_access_policy: Refreshing state... [id=xgr00q-test-keycloak]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
module.s3_sso_api_swagger.data.aws_iam_policy_document.deny_non_secure_access_doc: Reading...
module.s3_sso_api_swagger.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-test-api-swagger,private]
module.s3_sso_api_swagger.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-test-api-swagger]
aws_api_gateway_integration.openapi_swagger: Refreshing state... [id=agi-kcbkts0s8a-c4u2t7-GET]
aws_iam_role_policy.s3_read_access_policy: Refreshing state... [id=ApiGatewayAmazonS3AccessRole:AWSS3ResourceReadAccessRolePolicy]
module.s3_sso_api_swagger.data.aws_iam_policy_document.deny_non_secure_access_doc: Read complete after 0s [id=1476409885]
module.s3_sso_api_swagger.aws_s3_bucket_versioning.this: Refreshing state... [id=xgr00q-test-api-swagger]
aws_api_gateway_integration.openapi_swagger_assets: Refreshing state... [id=agi-kcbkts0s8a-d3qwx0-GET]
module.s3_sso_api_swagger.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-test-api-swagger]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js"]: Refreshing state... [id=swagger-ui-es-bundle.js]
aws_s3_object.swagger_dist["README.md"]: Refreshing state... [id=README.md]
aws_s3_object.swagger_dist["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.swagger_dist["swagger-output.json"]: Refreshing state... [id=swagger-output.json]
aws_s3_object.swagger_dist["absolute-path.js"]: Refreshing state... [id=absolute-path.js]
aws_s3_object.swagger_dist["swagger-ui.js.map"]: Refreshing state... [id=swagger-ui.js.map]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js.map"]: Refreshing state... [id=swagger-ui-standalone-preset.js.map]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js.map"]: Refreshing state... [id=swagger-ui-es-bundle-core.js.map]
aws_s3_object.swagger_dist["swagger-ui.css.map"]: Refreshing state... [id=swagger-ui.css.map]
aws_s3_object.swagger_dist["swagger-ui.js"]: Refreshing state... [id=swagger-ui.js]
aws_s3_object.swagger_dist["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js.map"]: Refreshing state... [id=swagger-ui-es-bundle.js.map]
aws_s3_object.swagger_dist["swagger-ui.css"]: Refreshing state... [id=swagger-ui.css]
aws_s3_object.swagger_dist["package.json"]: Refreshing state... [id=package.json]
aws_s3_object.swagger_dist["index.css"]: Refreshing state... [id=index.css]
aws_s3_object.swagger_dist["oauth2-redirect.html"]: Refreshing state... [id=oauth2-redirect.html]
aws_s3_object.swagger_dist["swagger-ui-bundle.js.map"]: Refreshing state... [id=swagger-ui-bundle.js.map]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js"]: Refreshing state... [id=swagger-ui-es-bundle-core.js]
aws_s3_object.swagger_dist["index.js"]: Refreshing state... [id=index.js]
aws_s3_object.swagger_dist["swagger-initializer.js"]: Refreshing state... [id=swagger-initializer.js]
aws_s3_object.swagger_dist["swagger-ui-bundle.js"]: Refreshing state... [id=swagger-ui-bundle.js]
aws_s3_object.swagger_dist["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js"]: Refreshing state... [id=swagger-ui-standalone-preset.js]
module.s3_sso_api_swagger.aws_s3_bucket_policy.deny_non_secure_access_policy: Refreshing state... [id=xgr00q-test-api-swagger]
aws_api_gateway_integration_response.openapi_swagger: Refreshing state... [id=agir-kcbkts0s8a-c4u2t7-GET-200]
aws_api_gateway_integration_response.openapi_swagger_assets: Refreshing state... [id=agir-kcbkts0s8a-d3qwx0-GET-200]
aws_lb_listener.redis[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ca-central-1:882670198625:listener/net/redis-nlb/97b762812053af45/1c79f84af2d1a81f]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_function.request_queue: Refreshing state... [id=request-queue]
aws_lambda_function.request_monitor: Refreshing state... [id=request-monitor]
aws_lambda_function.css_api: Refreshing state... [id=lambda-css-api]
data.aws_iam_policy.permissions_boundary_policy: Read complete after 1s [id=arn:aws:iam::882670198625:policy/sso-requests-boundary]
aws_iam_role.redis_task_execution_role[0]: Refreshing state... [id=RedisECSTaskExecutionRole]
aws_iam_role_policy.redis_task_execution_cwlogs[0]: Refreshing state... [id=RedisECSTaskExecutionRole:redis-task-exec-cwlogs]
aws_api_gateway_integration.app: Refreshing state... [id=agi-kcbkts0s8a-durnz2-ANY]
aws_ecs_task_definition.redis[0]: Refreshing state... [id=redis]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_lambda_permission.request_monitor: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.request_monitor: Refreshing state... [id=request-monitor-scheduler-request_monitor]
aws_lambda_permission.apigw_api: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.api: Refreshing state... [id=agi-kcbkts0s8a-qtwbra-ANY]
aws_cloudwatch_event_target.request_queue: Refreshing state... [id=request-queue-scheduler-request_queue]
aws_lambda_permission.request_queue: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_ecs_service.redis[0]: Refreshing state... [id=arn:aws:ecs:ca-central-1:882670198625:service/sso-ecs-cluster/redis]
aws_api_gateway_deployment.this: Refreshing state... [id=lps2zi]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_invocation" "db" {
      + function_name = "lambda-db"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2025-05-05T16:25:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "GtFiQrf3Ok1HPMpexZ/z/4DAJPWUcXxKXYz/99VQHKs=" -> "zdG73xxAtlJzyCMWID6JwGyfz6FhgwOVOGH220UtHvE="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.css_api will be updated in-place
  ~ resource "aws_lambda_function" "css_api" {
        id                             = "lambda-css-api"
      ~ last_modified                  = "2025-05-05T16:24:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "3k+jC7HagKoKHJNbeusTA1HBREhzoM0cnkLLp3XPtrQ=" -> "Y6LceaDO2K77m0gxQLVcqAgzt645nTH+x7pK9GaNFgs="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2025-05-05T16:24:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "43UTPYUA5z7JR6vgj8l/ix1nsGVOsyLPY3v79/xQQ+M=" -> "Mm/gCDdmRO0CujZqshLAx4sq9qj2bRUoCwf3Bg0y07M="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.request_monitor will be updated in-place
  ~ resource "aws_lambda_function" "request_monitor" {
        id                             = "request-monitor"
      ~ last_modified                  = "2025-05-05T16:24:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "OLZlLt78O4pZXFx32OSZtMXg7+yAuduOMCYI/JUPC9o=" -> "rOORWOBG5pF+uRB4IK9x+PEN4UUsmeiutEBIcuyrTl0="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.request_queue will be updated in-place
  ~ resource "aws_lambda_function" "request_queue" {
        id                             = "request-queue"
      ~ last_modified                  = "2025-05-05T16:24:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "LHwmbRqezysLho9LUUKW0GywCR9hh6B+AmiptVD0iIQ=" -> "Gq234auFrSfnfxXPggGIz4XCCyCjG8sHfZ59Pl2aKk4="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (27 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - logs    = [
              - jsonencode(
                    [
                      - {
                          - event = "migrating"
                          - name  = "2025.03.20T09.43.69.add-social-confirmation"
                        },
                    ]
                ),
              - jsonencode(
                    [
                      - {
                          - durationSeconds = 0.192
                          - event           = "migrated"
                          - name            = "2025.03.20T09.43.69.add-social-confirmation"
                        },
                    ]
                ),
            ]
          - success = true
        }
      - headers    = {
          - time = "2025-05-05T16:25:00.773Z"
        }
      - statusCode = 200
    } -> (known after apply)

Warning: Argument is deprecated

  with aws_api_gateway_deployment.this,
  on api-gateway.tf line 197, in resource "aws_api_gateway_deployment" "this":
 197:   stage_name  = "test"

stage_name is deprecated. Use the aws_api_gateway_stage resource instead.

(and one more similar warning elsewhere)

Warning: Deprecated attribute

  on api-gateway.tf line 227, in output "base_url":
 227:   value = aws_api_gateway_deployment.this.invoke_url

The attribute "invoke_url" is deprecated. Refer to the provider documentation
for details.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jlangy, Action: `pull_request`*